{
  "projects": [
    {
      "id": "german-with-nik",
      "title": "German with Nik: Voice-First German Learning AI App",
      "company": "Personal Project",
      "year": "2023 - 2024",
      "shortDescription": "A mobile app offering personalized, voice-based German language learning through an AI assistant named Nik, making real-time conversational learning accessible and affordable.",
      "situation": "The idea came from my own struggle with learning German after moving to Germany in 2023. Traditional classes and native speaker conversations weren't effective, which inspired the use of generative AI to build a truly interactive tutor.",
      "steps": {
        "research": [
          "Analyzed existing language learning apps and found they lacked real-time conversation learning",
          "Conducted market analysis showing coaching costs of €100–€200+ per month",
          "Gathered early feedback from Reddit that confirmed strong interest"
        ],
        "strategy": [
          "Created a POC using ChatGPT that showed promising results",
          "Defined user persona: Highly motivated language learners seeking affordable, interactive experiences",
          "Established monetization model: Free trial + Subscription (Monthly/Yearly)"
        ],
        "development": [
          "Designed system architecture: [User Voice Input] → STT (OpenAI Whisper-1) → LLM Agent (Groq LLAMA + RAG) → TTS → [Voice Output by Nik]",
          "Built server using WebSocket-based Node.js with RAG using German lesson documents",
          "Developed client using Expo React Native app",
          "Released multiple versions with progressive improvements from basic flow to payment integration"
        ]
      },
      "impact": [
        "Achieved 85% download to install conversion rate",
        "Secured 35% trial to paid conversion",
        "Maintained 40% 30-day retention rate",
        "Optimized system performance with 2.5 sec overall latency",
        "Established profitable economics with €10 monthly revenue per user vs €2 cost"
      ],
      "lessons": [
        "Voice-first interfaces create more engaging language learning experiences",
        "RAG significantly improves contextual accuracy in language tutoring",
        "Latency optimization is critical for conversational applications",
        "Free trial model works effectively for educational apps with clear value proposition"
      ]
    },
    {
      "id": "zeta-change-management",
      "title": "Enterprise Banking Platform Transformation",
      "company": "Zeta Tech (Directi)",
      "year": "2022 - 2023",
      "shortDescription": "Strategic team alignment for financial technology scale, leading to accelerated delivery timelines and improved collaboration.",
      "situation": "Platform and Solutions Teams were misaligned with different goals, creating delivery bottlenecks.",
      "steps": {
        "research": [
          "Conducted stakeholder interviews across teams to identify core friction points",
          "Analyzed development workflows and team structures"
        ],
        "strategy": [
          "Developed dual-track approach to platform and product development",
          "Designed new team structure and collaboration framework"
        ],
        "development": [
          "Implemented agile ceremonies to align roadmaps",
          "Created shared KPIs between platform and product teams"
        ]
      },
      "impact": [
        "Reduced delivery time by 50%",
        "Improved platform quality with 40% fewer critical bugs",
        "Enhanced team morale and reduced attrition by 30%",
        "Strengthened customer relationships with more predictable releases"
      ],
      "lessons": [
        "Organizational design is as critical as technical architecture",
        "Executive sponsorship is essential for structural changes",
        "Sharing context between teams is more valuable than rigid processes"
      ]
    },
    {
      "id": "zeta-identity-platform",
      "title": "Self-Serve Identity Platform",
      "company": "Zeta Tech (Directi)",
      "year": "2021 - 2022",
      "shortDescription": "Built a self-service identity platform that reduced support tickets by 30% and transformed access management across internal and external users.",
      "situation": "Identity changes and access requests relied on tenant admins and manual workflows, creating friction and ticket overhead.",
      "steps": {
        "research": [
          "Traced user journeys to identify pain points",
          "Interviewed customers and admins about access management"
        ],
        "strategy": [
          "Designed self-service portal for all identity management",
          "Created approval workflows to maintain security"
        ],
        "development": [
          "Built role-based access management system",
          "Implemented audit trails and compliance reporting"
        ]
      },
      "impact": [
        "Reduced support tickets by 30%",
        "Eliminated 2-5 day wait times for access changes",
        "Created industry-standard experience comparable to Okta and Ping"
      ],
      "lessons": [
        "Self-service requires clear guardrails and policies",
        "Identity management is a key enabler of business agility",
        "UX investment has exponential returns in identity products"
      ]
    }
  ]
} 